Repository: michelengelen/straight-pool-sheet
Catalog: res/values/strings_*.arb
Languages: de

# app_title
source: Pro Billard Tool
de: 14/1 Helper

# screen_home_title
source: Home
de: Startseite

# icon_home_semantic
source: go to Home Screen
de: Zur Startseite wechseln

# screen_profile_title
source: Profile
de: Profil

# icon_profile_semantic
source: go to User Profile Screen
de: Zur Profilseite wechseln

# screen_settings_title
source: Settings
de: Einstellungen

# icon_settings_semantic
source: go to Settings Screen
de: Zur Profilseite wechseln

# setting_language_title
source: Language
de: Sprache

# setting_language_subtitle
source: Currently selected language: $languageCode
de: Aktuell ausgewählte Sprache: $languageCode

# setting_language_switched
source: Language switched to english
de: Aktuelle Sprache zu deutsch geändert

# setting_darkMode_subtitle
source: Enable dark mode
de: Dark mode aktivieren

# setting_darkMode_switched_on
source: Dark mode enabled
de: Dark mode aktiviert

# setting_darkMode_switched_off
source: Dark mode disabled
de: Dark mode deaktiviert

# snackbar_user_loaded_success
source: User loaded successfully
de: Nutzer erfolgreich geladen

# snackbar_user_loaded_failure
source: Could not load user
de: Nutzer konnte nicht geladen werden

# snackbar_retry
source: Retry
de: Wiederholen

source: Logout
de: Abmelden

# icon_logout_semantic
source: Log out the current user
de: Den aktuellen Nutzer abmelden

# locales_en
source: English
de: Englisch

# locales_de
source: German
de: Deutsch

# ERROR_TOO_MANY_REQUESTS
source: There were too many requests. Please wait a bit and try again later.
de: Es wurde zu oft versucht sich mit diesem Account anzumelden. Versuche es später noch einmal.

# ERROR_INVALID_EMAIL
source: The email address is invalid.
de: Die E-Mail Adresse ist ungültig.

# ERROR_WRONG_PASSWORD
source: The password is invalid.
de: Das Passwort ist ungültig.

# ERROR_USER_NOT_FOUND
source: User not found.
de: Account nicht gefunden.

# ERROR_INVALID_CREDENTIAL
source: Invalid login credentials provided.
de: Ungültiger Login-Token. Bitte erneut anmelden.

# ERROR_USER_DISABLED
source: User is disabled.
de: Dieser Account wurde deaktiviert. Wenden Sie sich an den Support.

# ERROR_ACCOUNT_EXISTS_WITH_DIFFERENT_CREDENTIAL
source: There is already another account associated with this email address. Please use the service you used before to log in.
de: Es ist bereits ein Account mit dieser E-Mail Adresse verknüpft. Nutzen Sie bitte die korrekte Anmeldemethode.

# ERROR_OPERATION_NOT_ALLOWED
source: This log in method is not supported. Please use another one.
de: Diese Anmeldemethode wird nicht unterstützt. Nutzen Sie bitte eine der anderen Methoden.

# ERROR_CANCELLED_BY_USER
source: The user cancelled the authentication process.
de: Abbruch des Anmeldevorgangs durch den Nutzer.

# ERROR_UNDEFINED
source: Something went wrong. Please try again later.
de: Operation fehlgeschlagen. Bitte versuchen Sie es erneut.

# ERROR_CRITICAL
source: A critical error occured. Please try again later
de: Ein kritischer Fehler ist aufgetreten. Bitte versuchen Sie es später erneut.
